**Laboratorium nr 2**

Sylwia Michalska , gr.3

In [1]:
import sqlalchemy
from sqlalchemy import create_engine
import warnings
warnings.filterwarnings('ignore')
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"
db = create_engine(db_string)
connection_sqlalchemy = db.connect()

In [3]:
import psycopg2 as pg
import pandas as pd

connect = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

 Ile kategorii filmów mamy w wypożyczalni?

In [4]:
df = pd.read_sql("SELECT COUNT(DISTINCT name) FROM category;",con=connect)
print(df)

   count
0     16

Wyświetl listę kategorii w kolejności alfabetycznej.

In [5]:
df = pd.read_sql("SELECT name FROM category ORDER BY name ASC;",con=connect)
print(df)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [6]:
df = pd.read_sql('SELECT title,release_year FROM  film', con=connect)
print(df)
#wszystkie filmy mają ten sam rok wydania

                 title  release_year
0      Chamber Italian          2006
1     Grosse Wonderful          2006
2      Airport Pollock          2006
3    Bright Encounters          2006
4     Academy Dinosaur          2006
..                 ...           ...
995     Young Language          2006
996         Youth Kick          2006
997       Zhivago Core          2006
998  Zoolander Fiction          2006
999          Zorro Ark          2006

[1000 rows x 2 columns]

 Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [7]:
df = pd.read_sql("SELECT COUNT(rental_date) FROM rental WHERE rental_date BETWEEN '2005-07-01' AND '2005-08-01' ;",con=connect)
print(df)

   count
0   6709

Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [8]:
df = pd.read_sql("SELECT COUNT(rental_date) FROM rental WHERE rental_date BETWEEN '2010-01-01' AND '2011-02-01' ;",con=connect)
print(df)

   count
0      0

Znajdź największą płatność wypożyczenia.

In [9]:
df = pd.read_sql("SELECT MAX(amount) FROM payment;",con=connect)
print(df)

     max
0  11.99

Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [11]:
df = pd.read_sql("SELECT customer.first_name ||' '|| customer.last_name customers,country FROM customer INNER JOIN address ON address.address_id = customer.address_id INNER JOIN city ON city.city_id=address.city_id INNER JOIN country ON country.country_id=city.country_id WHERE country='Poland' OR country='Nigeria' OR country='Bangladesh' ORDER BY country ;",con=connect)
print(df)

           customers     country
0     Michelle Clark  Bangladesh
1     Stephen Qualls  Bangladesh
2     Frank Waggoner  Bangladesh
3       Marilyn Ross     Nigeria
4       Elsie Kelley     Nigeria
5    Gladys Hamilton     Nigeria
6      Sonia Gregory     Nigeria
7     Rodney Moeller     Nigeria
8        Velma Lucas     Nigeria
9       Carol Garcia     Nigeria
10      Olga Jimenez     Nigeria
11   Bertha Ferguson     Nigeria
12    Tracey Barrett     Nigeria
13         Jo Fowler     Nigeria
14     Wallace Slone     Nigeria
15    Constance Reid     Nigeria
16       Brian Wyman      Poland
17   Sidney Burleson      Poland
18   Marjorie Tucker      Poland
19   Russell Brinson      Poland
20       Leah Curtis      Poland
21       Ruben Geary      Poland
22  Johnnie Chisholm      Poland
23  Jimmie Eggleston      Poland

Gdzie mieszkają członkowie personelu?

In [12]:
df = pd.read_sql("SELECT DISTINCT(city.city) FROM staff INNER JOIN address ON address.address_id=staff.address_id INNER JOIN city ON city.city_id=address.city_id;",con=connect)
print(df)

         city
0   Woodridge
1  Lethbridge

Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [13]:
df = pd.read_sql("SELECT COUNT(staff.last_name) FROM staff INNER JOIN address ON address.address_id=staff.address_id INNER JOIN city ON city.city_id=address.city_id INNER JOIN country ON country.country_id=city.country_id WHERE country='Spain' OR country='Argentina';",con=connect)
print(df)

   count
0      0

Jakie kategorie filmów zostały wypożyczone przez klientów?

In [14]:
df = pd.read_sql("SELECT DISTINCT(category.name) FROM category INNER JOIN film_category ON film_category.category_id=category.category_id INNER JOIN film ON film.film_id=film_category.film_id INNER JOIN inventory ON inventory.film_id=film.film_id INNER JOIN rental ON rental.inventory_id=inventory.inventory_id  INNER JOIN customer ON customer.customer_id=rental.rental_id WHERE rental IS NOT NULL ;",con=connect)
print(df)

           name
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.

In [15]:
df = pd.read_sql("SELECT DISTINCT(category.name) FROM category INNER JOIN film_category ON film_category.category_id=category.category_id INNER JOIN film ON film.film_id=film_category.film_id INNER JOIN inventory ON inventory.film_id=film.film_id INNER JOIN rental ON rental.inventory_id=inventory.inventory_id  INNER JOIN customer ON customer.customer_id=rental.rental_id INNER JOIN address ON address.address_id = customer.address_id INNER JOIN city ON city.city_id=address.city_id INNER JOIN country ON country.country_id=city.country_id WHERE country='United States' ;",con=connect)
print(df)

           name
0        Action
1      Children
2      Classics
3        Comedy
4   Documentary
5         Drama
6        Family
7       Foreign
8         Games
9        Horror
10        Music
11          New
12       Sci-Fi
13       Sports
14       Travel

Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [16]:
df = pd.read_sql("SELECT film.title, actor.first_name || ' ' ||actor.last_name actor FROM film INNER JOIN film_actor ON film_actor.film_id=film.film_id INNER JOIN actor ON actor.actor_id=film_actor.actor_id WHERE (first_name='Olympia' AND last_name='Pfeiffer') OR (first_name='Julia' AND last_name='Zellweger') OR (first_name='Ellen' AND last_name='Presley') ;",con=connect)
print(df)

                title            actor
0     Bilko Anonymous    Ellen Presley
1   Caribbean Liberty    Ellen Presley
2    Casper Dragonfly    Ellen Presley
3    Empire Malkovich    Ellen Presley
4       Floats Garden    Ellen Presley
..                ...              ...
64       Outlaw Hanky  Julia Zellweger
65    Panky Submarine  Julia Zellweger
66   Rider Caddyshack  Julia Zellweger
67          Won Dares  Julia Zellweger
68      Wyoming Storm  Julia Zellweger

[69 rows x 2 columns]